作業目標:<br>
1. 熟悉分組計算

作業重點: <br>
1. 分組計算也可以加入apply自定義的函數

題目 : 運用下列分數資料分析<br>
1. 找出全年級各科成績最高分與最低分?<br>
2. 找出數學班平均最高的班級?<br>
3. 分析全校女生與男生國文平均差幾分?<br>
score_df = pd.DataFrame([[1,50,80,70,'boy',1],[2,60,45,50,'boy',2],[3,98,43,55,'boy',1],[4,70,69,89,'boy',2],[5,56,79,60,'girl',1],[6,60,68,55,'girl',2],[7,45,70,77,'girl',1],[8,55,77,76,'girl',2],[9,25,57,60,'girl',1],[10,88,40,43,'girl',3],[11,25,60,45,'boy',3],[12,80,60,23,'boy',3],[13,20,90,66,'girl',3],[14,50,50,50,'girl',3],[15,89,67,77,'girl',3]],columns=['student_id','math_score','english_score','chinese_score','sex','class'])

In [1]:
import pandas as pd
score_df = pd.DataFrame([[1,50,80,70,'boy',1], 
              [2,60,45,50,'boy',2],
              [3,98,43,55,'boy',1],
              [4,70,69,89,'boy',2],
              [5,56,79,60,'girl',1],
              [6,60,68,55,'girl',2],
              [7,45,70,77,'girl',1],
              [8,55,77,76,'girl',2],
              [9,25,57,60,'girl',1],
              [10,88,40,43,'girl',3],
              [11,25,60,45,'boy',3],
              [12,80,60,23,'boy',3],
              [13,20,90,66,'girl',3],
              [14,50,50,50,'girl',3],
              [15,89,67,77,'girl',3]],columns=['student_id','math_score','english_score','chinese_score','sex','class'])
score_df

    student_id  math_score  english_score  chinese_score   sex  class
0            1          50             80             70   boy      1
1            2          60             45             50   boy      2
2            3          98             43             55   boy      1
3            4          70             69             89   boy      2
4            5          56             79             60  girl      1
5            6          60             68             55  girl      2
6            7          45             70             77  girl      1
7            8          55             77             76  girl      2
8            9          25             57             60  girl      1
9           10          88             40             43  girl      3
10          11          25             60             45   boy      3
11          12          80             60             23   boy      3
12          13          20             90             66  girl      3
13          14          50             50             50  girl      3
14          15          89             67             77  girl      3

### 1. 找出全年級各科成績最高分與最低分?

In [7]:
score_df.max()
# math_score         98
# english_score      90
# chinese_score      89

student_id         15
math_score         98
english_score      90
chinese_score      89
sex              girl
class               3
dtype: object

In [8]:
score_df.min()
# math_score        20
# english_score     40
# chinese_score     23

student_id         1
math_score        20
english_score     40
chinese_score     23
sex              boy
class              1
dtype: object

### 2. 找出數學班平均最高的班級?

In [13]:
score_df.groupby('class').mean()   # class 2

       student_id  math_score  english_score  chinese_score
class
1             5.0   54.800000      65.800000      64.400000
2             5.0   61.250000      64.750000      67.500000
3            12.5   58.666667      61.166667      50.666667

### 3. 分析全校女生與男生國文平均差幾分?

In [17]:
score_df.groupby('sex').agg('mean')

      student_id  math_score  english_score  chinese_score     class
sex
boy     5.500000   63.833333      59.500000      55.333333  2.000000
girl    9.666667   54.222222      66.444444      62.666667  2.111111

In [21]:
boy_chi_score = score_df.groupby('sex').agg('mean').loc['boy', 'chinese_score']
girl_chi_score = score_df.groupby('sex').agg('mean').loc['girl', 'chinese_score']

In [22]:
girl_chi_score - boy_chi_score

7.333333333333329